//落子，1：人，2：电脑

var scorebase = [
	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
	0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 0,
	0, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 4, 4, 4, 4, 4, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 5, 5, 5, 5, 5, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 5, 6, 6, 6, 5, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 5, 6, 7, 6, 5, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 5, 6, 6, 6, 5, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 5, 5, 5, 5, 5, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 4, 4, 4, 4, 4, 4, 4, 3, 2, 1, 0,
	0, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 1, 0,
	0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 0,
	0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
];

//死二，死三，死四  	 0
//大跳活二				 1
//跳活二，眠二			 2
//连活二，眠三			 3
//跳活三，冲四			 4
//连活三 				 5
//活四，双四，双三，四三 100
//成五 					 1000
var level = [0, 1, 2, 3, 4, 5, 100, 1000],
	direction = [-1, -16, -15, -14, 1, 16, 15, 14] //左，左上，上，右上，右，右下，下，左下

var getlength = function(array, start, direction) {
	var sum = 0;
	for (var i = 0; i < 15; i++) {}
}

//获取当前级别最高的排列
var getBest = function(array) {
	var best = 0;
	for (var i = 0; i < 225; i++) {

	}
}

var toArray = function(objs) {
	var array = [];
	for (var i = 0, len = objs.length; i < len; i++) {
		var value = $(objs[i]).attr('data-value') | 0;
		array.push(value);
	}
	return array;
}

var score = function(pieces) {
	var array = toArray(pieces);
	getBest(array);
}